## 1. 설문조사 문항의 응답내역을 분석
- 문항별 응답내역이 'question'에 담겨 있을 때, 조건문과 반복문을 사용하여 아래와 같은 결과가 출력되도록 코드를 작성해보세요.
- 출력 예시 : ['Q2', 'Q3', 'Q4', 'Q5', 'Q8', 'Q9']
- 문항별 응답내용에는 하나의 응답만 할 수 있는 single choice 문제와 여러 응답을 선택할 수 있는 multiple choice 문제가 있습니다. 
- 2개를 구분하기 위해 single choice 문항 번호에 "_"를 표기하지 않기로 했습니다.

In [1]:
# 응답 설문 문항
question = ['Q2', 'Q3', 'Q4', 'Q5', 'Q6_1', 'Q6_2', 'Q6_3', 'Q6_4', 'Q6_5', 'Q6_6',
       'Q6_7', 'Q6_8', 'Q6_9', 'Q6_10', 'Q6_11', 'Q6_12', 'Q7_1', 'Q7_2',
       'Q7_3', 'Q7_4', 'Q7_5', 'Q7_6', 'Q7_7', 'Q8', 'Q9', 'Q10_1', 'Q10_2',
       'Q10_3']

In [14]:
result = []
count = len(question)
for i in range(count):
    if len(question[i]) == 2 : 
        result.append(question[i])
    else : 
        pass
result

['Q2', 'Q3', 'Q4', 'Q5', 'Q8', 'Q9']

## 2. 연도별, 국가별 평균 기대수명 출력
- 2011년 부터의 연도별, 국가별 평균 기대수명을 구해주세요. (2011년도 포함되게 구합니다.)
- [필수 조건] groupby 나 pivot_table을 활용합니다. groupby 로 구할 때 unstack()이라는 기능을 사용하여 아래와 같이 컬럼에 인덱스 값을 올려서 표기할 수 있습니다.
- 만약 행에는 '연도'가, 열에 '국가'가 들어있고 수치 데이터의 결과값이 아래와 같다면, 출력형태는 조금 달라도 괜찮습니다.

In [15]:
import pandas as pd

In [16]:
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/healthexp.csv")
df

     Year        Country  Spending_USD  Life_Expectancy
0    1970        Germany       252.311             70.6
1    1970         France       192.143             72.2
2    1970  Great Britain       123.993             71.9
3    1970          Japan       150.437             72.0
4    1970            USA       326.961             70.9
..    ...            ...           ...              ...
269  2020        Germany      6938.983             81.1
270  2020         France      5468.418             82.3
271  2020  Great Britain      5018.700             80.4
272  2020          Japan      4665.641             84.7
273  2020            USA     11859.179             77.0

[274 rows x 4 columns]

In [32]:
#2011년부터의 데이터만 확보
df = df[df['Year'] >= 2011]
df[:3]

     Year  Country  Spending_USD  Life_Expectancy
214  2011   Canada      4228.962             81.4
215  2011  Germany      4566.678             80.5
216  2011   France      4161.698             82.3

In [39]:
# 'Year'와 'Country'를 기준으로 'Life_Expectancy'의 평균값을 출력 
df_result = df.groupby(['Year', 'Country'])['Life_Expectancy'].agg(['mean']).unstack()
df_result

          mean
Country Canada France Germany Great Britain Japan   USA
Year
2011      81.4   82.3    80.5          81.0  82.7  78.7
2012      81.6   82.1    80.6          81.0  83.2  78.8
2013      81.7   82.3    80.6          81.1  83.4  78.8
2014      81.8   82.8    81.2          81.4  83.7  78.9
2015      81.9   82.4    80.7          81.0  83.9  78.7
2016      82.0   82.7    81.0          81.2  84.1  78.7
2017      81.9   82.7    81.1          81.3  84.2  78.6
2018      82.0   82.8    81.0          81.3  84.3  78.7
2019      82.2   82.9    81.3          81.4  84.4  78.8
2020      81.7   82.3    81.1          80.4  84.7  77.0

## 3. 이번 주에 배운 내용을 정리

### github  주소 
- python 정리 
- pandas 정리 
- 파일 경로 정리

## 4. 파일 불러오기

In [40]:
df = pd.read_csv('../dataset/서울특별시 강남구_생활폐기물배출량_20221019.csv', encoding="cp949")
df

    강남구  2019년(생활폐기물)-톤  2020년(생활폐기물)-톤
0   01월            7550            7350
1   02월            6387            6688
2   03월            7198            6973
3   04월            6820            6448
4   05월            7767            6470
5   06월            7275            7923
6   07월            8164            8015
7   08월            7807            7859
8   09월            6811            7452
9   10월            7222            6875
10  11월            7592            7337
11  12월            7298            6911